# Завдання 21
print("Завдання 21")
n = int(input("Введіть кількість хвилин: "))
hours = n // 60
print(hours, n - hours * 60, sep=" ")
print()
# Завдання 22
print("Завдання 22")
n = 600
m = 625
print((m + n) // n)
print()
# Завдання 23
print("Завдання 23")
km = int(input("Введіть відстань в кілометрах: "))
miles = km * 0.621371
print("Відстань в милях:", miles)
print()
# Завдання 24
print("Завдання 24")
c = int(input("Введіть температуру в градусах цельсія: "))
f = (c * 9 / 5) + 32
print("Температура в градусах фаренгейта:", f)
print()
# Завдання 25
print("Завдання 25")
b = float(input("Задайте основу трикутника: "))
h = float(input("Задайте висоту трикутника: "))
p = (1 / 2) * b * h
print("Площа трикутника:", p)
print()
# Завдання 26
print("Завдання 26")
a = float(input("Введіть довжину першого катета: "))
b = float(input("Введіть довжину другого катета: "))
p = (1 / 2) * a * b
print("Площа прямокутного трикутника:", p)
print()
# Завдання 27
print("Завдання 27")
a = float(input("Введіть довжину сторони 1: "))
b = float(input("Введіть довжину сторони 2: "))
c = float(input("Введіть довжину сторони 3: "))
s = (a + b + c) / 2
A = (s * (s - a) * (s - b) * (s - c)) ** (1 / 2)
print("Площа трикутника:", A)
print()
# Завдання 28
print("Завдання 28")
a = 5
b = 5
c = 6
s = (a + b + c) / 2
A = (s * (s - a) * (s - b) * (s - c)) ** (1 / 2)
P = a + b + c
print("Площа трикутника:", A, "кв.см")
print("Периметр трикутника:", P, "см")
print()